{
  "items": [
    {
      "description": "On the profiles, attitude, behaviors, and expectations between developers, managers and executives.",
      "items": [],
      "title": "Roles"
    },
    {
      "description": "You're in a competitive sector in which talents are in high demand. Be prepared as a manager to spend a lot of time recruiting people, either to expand your team or fill-in open positions. The dynamics gets interesting too, as you are now on both sides of the hiring process: as a candidate to get a job, and as a recruiter to staff up your team.",
      "items": [],
      "title": "Recruitment"
    },
    {
      "description": "By targeting the right place to post your job offer to, you're increasing your chances of targeting the right candidates.",
      "items": [
        {
          "children": [],
          "description": "Niche job boards by domains, technology, roles and area.",
          "title": "Awesome Job Boards",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2025-09-26T22:02:46Z",
            "owner": "tramcar",
            "repo": "awesome-job-boards",
            "stars": 1585
          }
        },
        {
          "children": [],
          "description": "List of companies without the kind of CS trivia questions that are associated with bad interview practices.",
          "title": "Hiring Without Whiteboards",
          "repo_info": {
            "archived": false,
            "language": "JavaScript",
            "last_commit": "2026-01-26T18:55:46Z",
            "owner": "poteto",
            "repo": "hiring-without-whiteboards",
            "stars": 50415
          }
        }
      ],
      "title": "Job Boards"
    },
    {
      "description": "List of questions that can be used when vetting potential candidates, and topics to draw inspiration from to be used as conversation starters.",
      "items": [
        {
          "children": [],
          "description": "Starts with anecdote of developers using a job interview as a vehicle to demonstrate their superiority. Then the author details a reasonable interview process that is trying to not waste anyone's time.",
          "title": "The Technical Interview is an Ego Trip"
        },
        {
          "children": [],
          "description": "1) Cut-Through on Crappy Tasks; 2) Knowing How to Finish; 3) Knowing How to Start; 4) Giving (And Receiving) Diagonal Feedback; 5) Harnessing the Value of Intangibles.”",
          "title": "The Intangible Skills You Can't Interview For"
        },
        {
          "children": [],
          "description": "A great source of inspiration.",
          "title": "Back-End Developer Interview Questions",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2024-11-15T07:09:42Z",
            "owner": "arialdomartini",
            "repo": "Back-End-Developer-Interview-Questions",
            "stars": 16553
          }
        },
        {
          "children": [],
          "description": "An outline on how to recruit for engineering manager roles.",
          "title": "Engineering Leadership Interviews",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2021-06-27T11:03:13Z",
            "owner": "kaushikb9",
            "repo": "em-interviews",
            "stars": 247
          }
        },
        {
          "children": [],
          "description": "Questions to ask the company during your interview. Be prepared to answer them as a manager.",
          "title": "Reverse interview",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2025-02-19T22:41:18Z",
            "owner": "viraptor",
            "repo": "reverse-interview",
            "stars": 28493
          }
        },
        {
          "children": [],
          "description": "A sample of question to ask in job interviews to try to understand the values of a company.",
          "title": "Culture Queries"
        },
        {
          "children": [],
          "description": "The essential of  on recruiting executives.",
          "title": "Book Summary of \"Who: The A Method for Hiring\""
        },
        {
          "children": [],
          "description": "It's true that not all developers make positive contributions, however, I think that blaming \"lowering hiring standards\" (…) is a complete red herring.” () - Examples in which developers that might pass tough job interview just fine are bringing negative value later.",
          "title": "source"
        }
      ],
      "title": "Interview"
    },
    {
      "description": "The absence of coding exercise will left the door open to fraud. OTOH, if elitist challenges decrease the number of false-positive, you will pass on perfectly capable and great developers. Now it is your job as manager to find balance between these two extremes, and set the tone on how to have the candidate demonstrate coding skills.",
      "items": [
        {
          "children": [],
          "description": "Instead of writing code, consider having the candidate read existing code and talk about how it works. 1) Reading code is 95% of what a developer does as part of their job. 2) A candidate can tell you a lot about their programming skill in the first five minutes of reading. 3) Stress is your enemy because it raises adrenaline which lowers IQ by several points, causing you to miss good candidates.”",
          "title": "How to Freaking Find Great Developers By Having Them Read Code"
        },
        {
          "children": [],
          "description": "When it comes to writing code, the number one most important skill is how to keep a tangle of features from collapsing under the weight of its own complexity.”",
          "title": "Organizational Skills Beat Algorithmic Wizardry"
        },
        {
          "children": [],
          "description": "The dark side on relying too much on algorithm challenges.",
          "title": "The Horrifically Dystopian World of Software Engineering Interviews"
        },
        {
          "children": [],
          "description": "Designed to help filter out the 99.5% of programming job candidates who can't seem to program their way out of a wet paper bag.”",
          "title": "Fizz Buzz Test"
        },
        {
          "children": [],
          "description": "Five multiple-choice questions to easily separate the real software engineers from the rest.",
          "title": "FizzBuzz 2.0: Pragmatic Programming Questions for Software Engineers"
        },
        {
          "children": [],
          "description": "A satire of over-engineering for the sake of enterprise-grade software.",
          "title": "FizzBuzz Enterprise Edition",
          "repo_info": {
            "archived": false,
            "language": "Java",
            "last_commit": "2024-07-15T08:04:08Z",
            "owner": "EnterpriseQualityCoding",
            "repo": "FizzBuzzEnterpriseEdition",
            "stars": 23218
          }
        },
        {
          "children": [],
          "description": "A huge database of questions sorted by topic to get inspiration from.",
          "title": "Awesome Interviews",
          "repo_info": {
            "archived": true,
            "language": null,
            "last_commit": "2024-07-29T14:21:23Z",
            "owner": "MaximAbramchuck",
            "repo": "awesome-interview-questions",
            "stars": 80794
          }
        }
      ],
      "title": "Coding Challenge"
    },
    {
      "description": "",
      "items": [
        {
          "children": [],
          "description": "Laws, Theories, Principles and Patterns that developers will find useful.",
          "title": "hacker-laws",
          "repo_info": {
            "archived": false,
            "language": "HTML",
            "last_commit": "2026-02-06T05:42:14Z",
            "owner": "dwmkerr",
            "repo": "hacker-laws",
            "stars": 26996
          }
        },
        {
          "children": [],
          "description": "There is a spectrum between perfect efficiency and being completely flexible. This article explores ecosystems and the flows of material and energy between different organisms within the ecosystem. ()",
          "title": "Adaptation vs adaptability"
        },
        {
          "children": [],
          "description": "If you still doubt management culture could make or break an industry: “inefficient management practices have kept southern European firms from taking full advantage of the IT revolution”.",
          "title": "The IT revolution and southern Europe's two lost decades"
        },
        {
          "children": [],
          "description": "The people are smarter, your manager (and their manager) cares a lot about you and it's easy to move.”",
          "title": "Meaningful differences that makes Google offices more productive"
        },
        {
          "children": [],
          "description": "It's harder to be kind than clever”, or put another way by Abraham Joshua Heschel: “When I was young, I used to admire intelligent people; as I grow older, I admire kind people.”",
          "title": "It's Not Enough to Be Right—You Also Have to Be Kind"
        },
        {
          "children": [],
          "description": "It is not your job to protect people (particularly senior management) from the consequences of their decisions. Make your decisions in your own best interest; it is up to the organization to make sure that your interest aligns with theirs.” ().",
          "title": "source"
        },
        {
          "children": [],
          "description": "If you cannot disrupt a perverted culture by introducing a new culture, the politics of the perverted culture will work against you until you break, align, or leave. It is not unwise to leave before you break and it is easier to leave before you align.” () - At one point, even with the most unselfish of intentions, your attempts to elevate the culture might stall. It is not fair, but it's probably the time to leave.",
          "title": "source"
        },
        {
          "children": [],
          "description": "1. Change you; 2. Change the other; 3. Fly; 4. Stay and suffer.” A more concise way of saying the same thing as above.",
          "title": "You have only 4 options"
        },
        {
          "children": [],
          "description": "The actual company values, as opposed to the nice-sounding values, are shown by who gets rewarded, promoted, or let go.”",
          "title": "Netflix Culture"
        },
        {
          "children": [],
          "description": "A list of books, web pages, and videos about how to design better organizations, divided into 3 categories: organization and motivation, health and wellness, and software development specific.",
          "title": "High Performance Organizations Reading List",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2025-09-21T15:32:16Z",
            "owner": "pdfernhout",
            "repo": "High-Performance-Organizations-Reading-List",
            "stars": 1263
          }
        },
        {
          "children": [],
          "description": "Scaling systems is not only a technical challenge. It has to be about teams and culture too. One lesson learned from the early days of AWS: “Giving developers operational responsibilities has greatly enhanced the quality of the services, both from a customer and a technology point of view. (…) You build it, you run it.”",
          "title": "A Conversation with Werner Vogels, Learning from the Amazon technology platform"
        },
        {
          "children": [],
          "description": "A compilation of anonymous sources from AWS which ehoes the interview above: “teams are ostensibly autonomous and can make any important decision needed to meet their goals.”",
          "title": "The principles of Amazon service-oriented collaboration"
        }
      ],
      "title": "Culture"
    },
    {
      "description": "Thinking frameworks and mental models to improve decision making, understand systems and solve problems.",
      "items": [],
      "title": "Cognitive Tools"
    },
    {
      "description": "You're no longer an engineer. Still, your team is responsible for the systems, technology and all the processes surrounding them. You'd better know a bit about engineering tenets.",
      "items": [],
      "title": "Engineering"
    },
    {
      "description": "The Product Manager is supposed to be the voice of the market. Here are more links on the role and its reach.",
      "items": [
        {
          "children": [],
          "description": "You're the broker for a lot of unstructured information and have to fend off all kinds of disruptive influences to land even close to where you're trying to go.” ()",
          "title": "source"
        },
        {
          "children": [],
          "description": "A reference. All the missing pieces are found below.",
          "title": "Awesome Product Management",
          "repo_info": {
            "archived": false,
            "language": "CSS",
            "last_commit": "2026-02-08T02:36:12Z",
            "owner": "dend",
            "repo": "awesome-product-management",
            "stars": 1969
          }
        },
        {
          "children": [],
          "description": "Resources, interviews, case studies, sample products & projects, communities, open source tools, free & paid services on product management, for technical people to learn the field.",
          "title": "Open Product Management",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2024-07-01T15:25:07Z",
            "owner": "tron1991",
            "repo": "open-product-management",
            "stars": 4178
          }
        },
        {
          "children": [],
          "description": "A set of heuristics on tech companies and the ecosystem they live in.",
          "title": "Things Many People Find Too Obvious To Have Told You Already"
        },
        {
          "children": [],
          "description": "A simple set of question which helped DARPA evaluates research programs to generate big rewards by taking big risks.",
          "title": "The Heilmeier Catechism"
        },
        {
          "children": [],
          "description": "Lots of wisdom about space program management.",
          "title": "Akin's Laws of Spacecraft Design"
        },
        {
          "children": [],
          "description": "A satire with a grain of truth, especially the comparison between the basic vs experienced level.",
          "title": "How to exit vim, the Product Manager way",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2024-06-13T12:41:55Z",
            "owner": "hakluke",
            "repo": "how-to-exit-vim",
            "stars": 7157
          }
        }
      ],
      "title": "Product Management"
    },
    {
      "description": "It is not only about reading, writing and talking. It encompass all the social practice and context sharing of the team's activities.\nEspecially a software team, which generates a huge amount of knowledge. All this knowledge is fragile and about to be lost for good. Unless you materialization it in the form of writing.",
      "items": [],
      "title": "Communication"
    },
    {
      "description": "It's not only about the salary, but the whole package: equity, bonuses, perks, and the dealings around all of these.",
      "items": [],
      "title": "Compensation"
    },
    {
      "description": "As a manager, you have direct responsibility of the structure of the team. Past a certain size (around 8 to 12 depending on sources), you no longer have time to work with direct ICs, so you need to re-organize the team.\nAt a company level, re-orgs are mostly strategic and your influence on them depends on your political acumen.",
      "items": [],
      "title": "Re-organizations"
    },
    {
      "description": "Your contributions are always welcome! Please take a look at the contribution guidelines first.",
      "items": [],
      "title": "Contributing"
    },
    {
      "description": "The header image is based on a modified photo taken in November 2017 by Werner Du plessis.\n[1]: Peopleware: Productive Projects and Teams, 1987, page 34 (Addison-Wesley Professional, 3rd edition, 2013). [↑]",
      "items": [],
      "title": "Footnotes"
    }
  ],
  "metadata": {
    "last_updated": "2026-02-08T04:31:29.243Z",
    "original_repository": "kdeldycke/awesome-engineering-team-management",
    "source_repository": "v1nvn/enhansome-engineering-team-management",
    "source_repository_description": null,
    "title": "Untitled"
  }
}