{
  "items": [
    {
      "description": ":star2: means that it's a classic.\n:fire: means that it has more than 100,000 ratings on Goodreads.\nThe [number] at the end is the rounded version of the rating on Goodreads. If a series is not available as an individual book, the first book in the series is used for the rating.",
      "items": [],
      "title": "Novels"
    },
    {
      "description": "",
      "items": [],
      "title": "Epic Fantasy"
    },
    {
      "description": "The Lord of the Rings is a quest; the Hobbit a children's tale; the Silmarillion a history. This is one of the few novels, a story that shows the life of a tortured individual. This story borrows heavily from Scandinavian lore, and presents Turin as one of the most tragic of all of Tolkien's creations. It is my favourite story from all of his books, and I think it has the most advanced and beautiful look into the world of Middle Earth as a whole. - @RichardLitt",
      "items": [],
      "title": "Children of Húrin by J.R.R. Tolkien [3.9]"
    },
    {
      "description": "While many western themed novels have superheroes or powerful magicians, equally pleasing to read is eastern style novels with cultivators. If you're interested in seeing how it compares with standard fantasy this is a great series to get started with. - @depperm",
      "items": [],
      "title": "Cradle (2016) by Will Wight [4.1]"
    },
    {
      "description": "This is a beautiful but somewhat slow paced book with really good world building that we have come to expect and love from Brandon Sanderson. If you are not sure to read it because it's his first book, have no fear!!! Go ahead and read it, I can assure you, you will not regret it. - @Shadeslayer234",
      "items": [],
      "title": "Elantris (2005) by Brandon Sanderson [4.17] 🔥"
    },
    {
      "description": "Ground hog day combined with magician school turns out to be pretty interesting. Throw in some mind spiders, liches, and magical beasts and things get more interesting. - @depperm",
      "items": [],
      "title": "Mother of Learning (2021) by Domagoj Kurmaic [4.5]"
    },
    {
      "description": "In truth, this is ten books, but they aren't stand-alone. I would call this two series: the Corwin series of the first five books, and the Merlin series of the second.\nLike most high fantasy, I didn't so much read these books as devour them. The series was excellent. Corwin's story is the story within all of us; a desire to be loved, to make sense of the world, to win back the castle from the evil usurper. Amber - the city upon which all other cities are but a shadow. Like CS Lewis, this earth is only a shadow of the real earth. Corwin is one of my favourite characters from a fantasy series; it's not often that you get to talk to someone who was a soldier in Napolean's army, who knew Van Gogh, who remembers Paris at the turn of the century (his section on the chestnuts is exquisite).\nThere is so much good writing, so many beautiful places, that it is almost impossible to remember it all. Reading this book wasn't so much reading as being transported to faery for a day. I remember feeling totally at a loss after reading one afternoon, as if I had been transported; the next day, on top of a mountain, I had the exact same feeling, that I was somewhere else. Reading these books gave me the greatest joy that a book can give - being lost in another world. - @RichardLitt",
      "items": [],
      "title": "The Chronicles of Amber by Roger Zelazny [4.3]"
    },
    {
      "description": "Writing a good prequel is hard, but this series masterfully introduces the main characters. If you're reading by publishing year, it fills in the blanks in much of Royce and Hadrian's origin story that is hinted at later on. - @depperm",
      "items": [],
      "title": "The Riyria Chronicles (2013) by Michael J. Sullivan [4.3]"
    },
    {
      "description": "Chronologically this is second, but this series was published first. This series is what pulled me into reading all of Michael J Sullivan's other writings. Dynamic duos make a great story, and it's the same for this set of series. - @depperm",
      "items": [],
      "title": "The Riyria Revelations (2008) by Michael J. Sullivan [4.2]"
    },
    {
      "description": "This is one of the most ridiculous forays into world building, ever. At times, it reads like a textbook, but there are sections that are extremely powerful and characters that are gripping. The Silmarillion takes a bit more imagination and fortitude than the Lord of the Rings, but is worth the effort, especially if you've already read his other books a few times and want more. - @RichardLitt",
      "items": [],
      "title": "The Silmarillion by J.R.R. Tolkien [3.8] :fire:"
    },
    {
      "description": "Initially this started as a webserial, which might indicate shorter length, but there are 9 volumes (each 1k+ pages). While there are LitRPG themes of a sort, this is more of people being transported into another world not a game. The world building is some of the best: countries (with politics), magic, characters (good, bad, side), plans/plots, bias/hatred, and unique monsters. - @depperm",
      "items": [],
      "title": "The Wandering Inn (2018) by Pirateaba [4.3]"
    },
    {
      "description": "",
      "items": [],
      "title": "Standard Fantasy"
    },
    {
      "description": "This book stands up to a reread, and is a nice example of Neil Gaiman's ability to draw together a thousand different threads into one cohesive story. The scenes in the Wisconsin small towns stay with me much longer than the rest of the book - they're reminiscent of the much better book Peace by Gene Wolfe, not to say they're not well done. This is a quick and great read, and it continually surprises. - @RichardLitt",
      "items": [],
      "title": "American Gods by Neil Gaiman [4.1]"
    },
    {
      "description": "An outstanding book. I was blown away by how exceptionally other-worldly this book felt - it reminded me of Jack Vance and Gene Wolfe, which is how I found it. One of the quotes in the book is used as an opener in Wolfe's The Wizard Knight. The book follows a young boy as he seeks to become a knight, inspired by his reading a book titled \"The Book of Knights\". I can't recommend this book enough. - @RichardLitt",
      "items": [],
      "title": "The Book of Knights by Yves Menard [3.94]"
    },
    {
      "description": "Fantasy for the younger readers. Follow along two youths who visit their grandparents and discover that not everything is as it appears. - @depperm",
      "items": [],
      "title": "Fablehaven (2006) by Brandon Mull [4.1] :fire:"
    },
    {
      "description": "Some of the best short stories I have ever read; The Library is my favourite of all time, so much that I'm debating getting a tattoo from it. - @RichardLitt",
      "items": [],
      "title": "Ficciones by Jorge Luis Borges [4.5]"
    },
    {
      "description": "This book is quite realistic and reminded me of the stories my grandparents have told me. And just like me, everyone was upset when this adventure comes to an end. -@NivedithaBBhat",
      "items": [],
      "title": "Grandma's Bag Of Stories (2012) by Sudha Murthy [4.21]"
    },
    {
      "description": "Although the author gets a little too detailed in some of his descriptions about unimportant details making the story slower than most, the magic system is unique and well thought out. The detail helps build a world you can imagine existing. - @depperm",
      "items": [],
      "title": "Imager (2009) by L.E. Modesitt Jr. [4.02]"
    },
    {
      "description": "I found Jirel fascinating as a heroine of 1930s pulp fantasy. Throughout her adventures, Jirel's opponents constantly seek to victimize her, use her as bait, lure her in, or overpower her. Often she can't escape witnessing or even being part of horrific things, but she takes these impossible situations and confronts them on her own terms. I thought this was a nice alternative to always evading danger or using feminine wiles to get out of tight corners. Jirel is physically and emotionally capable without being a know-it-all or preternaturally lucky. Moore paints incredibly vivid pictures of fantastical realms and creatures. I think these stories would translate well into a graphic novel. This collection is a fascinating bent on traditional sword and sorcery tales and well worth the read. - @thejessleigh",
      "items": [],
      "title": "Jirel of Joiry (1934) by C. L. Moore [3.78]"
    },
    {
      "description": "This book takes a while to ramp up, but if you can get through the (intentionally) tedious first 100 pages or so, Jonathan Strange & Mr. Norrell is a true delight. The characters are engaging and well-drawn, and the history-style writing offers surprising opportunities for humor and dry wit. I absolutely loved this. - @thejessleigh",
      "items": [],
      "title": "Jonathan Strange & Mr. Norrell (2006) by Susanna Clarke [3.8] :fire:"
    },
    {
      "description": "This was an amazing read. It was a bit over a thousand words, but it went by fast as anything else. It really displays Carey's way with storytelling and worldbuilding. - @masonbose",
      "items": [],
      "title": "Kushiel's Dart by Jacqueline Carey [4.0]"
    },
    {
      "description": "These were beautiful, finely crafted short stories. Rarely for me, I read a few of them immediately after I finished them, to make sure that I got the more subtle details. The writing was absolutely exquisite. - @RichardLitt",
      "items": [],
      "title": "Orsinian Tales by Ursula K. Le Guin [3.7]"
    },
    {
      "description": "The first book in the Study series, Snyder does a great job of building the suspense throughout the novel because at the start Yelena gets poisoned and you think she'll die and it carries on throughout the book. I enjoyed how Yelena's magic trickles throughout the story and the reader doesn't find out too much at the beginning. - @louisefindlay23",
      "items": [],
      "title": "Poison Study (2005) by Maria V. Snyder [4.14]"
    },
    {
      "description": "This book inspired me at the age of 14 to get a tattoo I ended up getting 7 years later. This is the kind of fantasy I wish we were still making; half theological, fantastic and weird, somewhere between Grimm's Fairytales and George R.R. Martin. - @RichardLitt",
      "items": [],
      "title": "Princess and the Curdie by George MacDonald [4.0]"
    },
    {
      "description": "I read this book in high school and I loved how the book was able to merge the fantasy elements with relatable storylines aimed towards teenagers. - @jilloestreicher",
      "items": [],
      "title": "The Darkest Part of the Forest (2015) by Holly Black [3.85]"
    },
    {
      "description": "A pretty good children's story. Defined modern fantasy as we know it. - @RichardLitt",
      "items": [],
      "title": "The Hobbit by J.R.R. Tolkien [4.2] :star2: :fire:"
    },
    {
      "description": "Read this if you want to go on an acid trip and if you want to see the roots of modern fantasy. - @RichardLitt",
      "items": [],
      "title": "The King of Elfland's Daughter by Lord Dunsanay [3.8]"
    },
    {
      "description": "This was a delightful book. Short and sweet, it exhibits both Gaiman's ability to run with magic, and his deep love for the English countryside and mythology. - @RichardLitt",
      "items": [],
      "title": "The Ocean at the End of the Lane by Neil Gaiman [4.0]"
    },
    {
      "description": "Smith of Wooton Major is my favourite story by Tolkien, hands down. Lord of the Rings and all of Middle Earth can rot in comparison to this small, finely crafted story about a smith who goes to Faery, and a cook who bakes a cake. - @RichardLitt",
      "items": [],
      "title": "The Smith of Wooten Major by J.R.R. Tolkien [4.0]"
    },
    {
      "description": "I read this book at least once a year. The story is well told, easily approachable, has a lot of gems, and is a good trip. - @RichardLitt",
      "items": [],
      "title": "The Wizard Knight by Gene Wolfe [3.8]"
    },
    {
      "description": "A fantastic start to an amazing series. Schwab really knows how to 'set a scene', and create an environment that grips you and doesn't let go. - @masonbose",
      "items": [],
      "title": "Vicious by V.E. Schwab [4.25]"
    },
    {
      "description": "",
      "items": [],
      "title": "Allegory"
    },
    {
      "description": "This book is a metaphor. It is poignant, magical and somewhat weird. If you want to get swept away and really dive into a story, stop whatever you are doing and find a way to get your hands on a copy of this book. This is a story of a young man who is discovering himself where he meets a lot of people and experiences different feelings altogether. Reality almost seems sterile when we immerse ourselves in this book. It a must read book for fantasy lovers. - @NehaChaudhary311",
      "items": [],
      "title": "Kafka On the Shore by Haruki Murakami [4.1]"
    },
    {
      "description": "This was a weird, weird book, just like Phantastes. George MacDonald had a gift for writing essentially plotless books that journey through fantastic realms; but at no point do they ever become uninteresting. They were also the inspiration for a lot of later writers, most notably CS Lewis, and it is easy to see why. Worth the read. - @RichardLitt",
      "items": [],
      "title": "Lilith by George MacDonald [3.9]"
    },
    {
      "description": "See the review for Lilith, above. - @RichardLitt",
      "items": [],
      "title": "Phantastes by George MacDonald [4.0]"
    },
    {
      "description": "You know, this is still a pretty good read even if you're not a Christian. Christian, the protagonist, is pretty beleaguered by every possible obstacle on his way to Heaven, and it's fun just hearing how he gets out of scrapes. - @RichardLitt",
      "items": [],
      "title": "Pilgrim's Progress by John Bunyan [4.0]"
    },
    {
      "description": "",
      "items": [],
      "title": "Satire"
    },
    {
      "description": "Farmer Giles is one of my favourite encapsulated stories set in something akin to Old England. It's basically Tolkien's nod to classic fairy tale writers like Lord Dunsanay or MacDonald, but with some humor. \"Give us your crown!\" is one of my favourite quotes, and I am totally going to name my dog Garm. - @RichardLitt",
      "items": [],
      "title": "Farmer Giles of Ham by J.R.R. Tolkien [3.9]"
    },
    {
      "description": "This was a fun book, and a great collaboration. At times it is a bit clear where Neil Gaiman was writing, and I'm not sure that the book is better for his inclusions at points; he hadn't yet perfected his craft, I think. But the story as a whole is good. - @RichardLitt",
      "items": [],
      "title": "Good Omens by Terry Pratchett and Neil Gaiman [4.3]"
    },
    {
      "description": "This is a book that doesn't take away from the classic movie rendition of it, but adds to it. It stands alone as a fun little read. - @RichardLitt",
      "items": [],
      "title": "The Princess Bride by William Goldman [4.2] :fire:"
    },
    {
      "description": "",
      "items": [],
      "title": "Horror"
    },
    {
      "description": "Horror wouldn't be what it is today without HP Lovecraft. He spawned an entire sub-genre of weird aliens and psychological threats; some of the stories in this book are so good that I still shudder when I think of them. A master at work. - @RichardLitt",
      "items": [],
      "title": "The Call of Cthulhu and Other Weird Stories by H.P. Lovecraft [4.3]"
    },
    {
      "description": "Stephen King is as brilliant as he is prolific, having penned over fifty worldwide bestsellers and won multiple awards for his writing. Under The Dome is a real page turner that will keep you worrying about the wonderful and frightening cast of characters. It's no surprise a show was made based on the novel. - @JamesDrysdale",
      "items": [],
      "title": "Under The Dome by Stephen King [3.9] :fire:"
    },
    {
      "description": "",
      "items": [],
      "title": "Children's Books"
    },
    {
      "description": "Fell in love with this book when I first read it in 4th grade. I had always liked fairy tales, but this was the first I read that subverted the usual tropes. - @konpyuta",
      "items": [],
      "title": "Dealing with Dragons by Patricia C. Wrede [4.15]"
    },
    {
      "description": "The original story that inspired Miyazaki's film adaptation. Has a colorful, fun, and whimsical tone, but has an interesting twist. - @konpyuta",
      "items": [],
      "title": "Howl's Moving Castle by Diana Wynne Jones [4.3]"
    },
    {
      "description": "The story is a beautifully layered tale that blurs reality and fiction, filled with vivid characters and profound reflections that linger long after reading. - @benya2bfh",
      "items": [],
      "title": "The Neverending Story by Michael Ende [4.18] :fire:"
    },
    {
      "description": "One of the earliest books I can recall reading. This book is the best. - @RichardLitt",
      "items": [],
      "title": "The Saga of Eric the Viking _by Terry Jones, Michael Foreman_ [3.94]"
    },
    {
      "description": "",
      "items": [],
      "title": "Comic Books"
    },
    {
      "description": "Great adventure with a strong female protagonist. In a historical-based setting with interesting fantasy elements interspersed with cultural details. - @konpyuta",
      "items": [],
      "title": "Delilah Dirk and the Turkish Lieutenant by Tony Cliff [3.94]"
    },
    {
      "description": "A colorful, funny, and heart-warming take on the consequences of being able to change the past. The best word to describe this comic is delightful. - @sunrein",
      "items": [],
      "title": "Seconds by Bryan Lee O'Malley, Nathan Fairbairn [4.07]"
    },
    {
      "description": "Gorgeous comic based on a classic Scottish fairy tale, with lots of diversity represented. - @konpyuta",
      "items": [],
      "title": "The Black Bull of Norroway by Cat Seaton, Kit Seaton [3.76]"
    },
    {
      "description": "A heartwarming book that will teach adults and children to love and to let yourself be loved.\nKate DiCamillo takes us on an extraordinary journey, from the depths of the ocean to the net of a fisherman, from the top of a garbage heap to the fireside of a hoboes' camp, from the bedside of an ailing child to the bustling streets of Memphis. And along the way, we are shown a true miracle — that even a heart of the most breakable kind can learn to love, to lose, and to love again. - @e-costalmeida",
      "items": [],
      "title": "The Miraculous Journey of Edward Tulane by Kate diCamillo, Bagram Ibatoulline [4.36]"
    },
    {
      "description": "This series does a great job of portraying samurai life in ancient Japan, with characters who are all animals. The artistic style is simple and clean. - @depperm",
      "items": [],
      "title": "Usagi Yojimbo (1987) by Stan Sakai [4.1]"
    },
    {
      "description": "",
      "items": [],
      "title": "Movies"
    },
    {
      "description": "Best movie for SciFi lovers an Space enthusiast.\nAll important science fiction concepts combied together feels like magic of astronomy and science.-@yuvihere23",
      "items": [],
      "title": "Interstellar [8.6]"
    },
    {
      "description": "A brilliant fantasy movie. Underrated. - @ErvinaDe",
      "items": [],
      "title": "Birth [6.1]"
    },
    {
      "description": "Sean Connery is the best dragon ever. This is a classic film. - @RichardLitt",
      "items": [],
      "title": "Dragonheart [6.4] :star2:"
    },
    {
      "description": "An animated fantasy classic collaboration between Ralph Bakshi and Frank Frazetta. This movie has great animation and even greater action. - @teav",
      "items": [],
      "title": "Fire and Ice [6.6]"
    },
    {
      "description": "This is an awesomely atrocious film. The only thing that is awesome about it is how amazingly poorly done everything is, and yet how it still is extremely entertaining. A must. - @RichardLitt",
      "items": [],
      "title": "Highlander [7.2]"
    },
    {
      "description": "Worse than the first, but in the best way possible. - @teav",
      "items": [],
      "title": "Highlander II: The Quickening [4.3]"
    },
    {
      "description": "Truly a horrendous film. But would make a great drinking game, so I am including it. Also, early Liam Neeson is great. - @RichardLitt",
      "items": [],
      "title": "Krull [6.0]"
    },
    {
      "description": "This is one of the weirder cult classics to come out of the 80's. I wouldn't include this here if David Bowie's performance wasn't so incredible. But it is. - @RichardLitt",
      "items": [],
      "title": "Labyrinth [7.4]"
    },
    {
      "description": "This movie really captures the ways thinking of some writers who are always wondering how would it be if they lived in some other century. Besides, Owen Wilson killed it. - @ErvinaDe",
      "items": [],
      "title": "Midnight in Paris [7.7]"
    },
    {
      "description": "Kids have been waiting for this movie adaptation for a long time; too bad they'll be disappointed. A movie with demigods in a modern era. - @AshishKnightfury",
      "items": [],
      "title": "Percy Jackson & the Olympians: The Lightning Thief [5.9]"
    },
    {
      "description": "Beautiful and stunning film with strong female characters. Even if you're not familiar with Japanese animation movies, I'm sure you will enjoy this one. - @maysaborges",
      "items": [],
      "title": "Princess Mononoke [8.4]"
    },
    {
      "description": "A fun and thrilling sequel, I enjoyed this adventure of found family and figuring out what you want is already with you. Great cast of characters and villains, this movie makes good use of the motivations they all have. - [@Shadowsarespooky] (https://github.com/Shadowsarespooky)",
      "items": [],
      "title": "Puss in Boots: The Last Wish [7.9]"
    },
    {
      "description": "An incredible film for the vision of the world, and the way they combine medieval technology with modern warfare. The dragons are bad-ass. - @RichardLitt",
      "items": [],
      "title": "Reign of Fire [6.2]"
    },
    {
      "description": "A beautifully drawn and wonderfully composed work of art - really, no other description will do. Don't let the fact that it is animated scare you. Just watch it! - @TheSherlockHomie",
      "items": [],
      "title": "Spirited Away [8.6]"
    },
    {
      "description": "A classic piece of 80s fantasy. It's basically Conan the Barbarian with some ferrets. - @teav",
      "items": [],
      "title": "The BeastMaster [6.2]"
    },
    {
      "description": "One of the best love stories ever told. This movie has everything any kid could want, and the book is just as good - it's satirical but not overly self-indulgent. - @RichardLitt",
      "items": [],
      "title": "The Princess Bride [8.2] :star2:"
    },
    {
      "description": "The fate of the world does not really hang in balance, contrary to what the movie says. Still very fun to watch, especially if you're part of Gen Z, or have kids in primary school. - @TheSherlockHomie",
      "items": [],
      "title": "The Sorcerer's Apprentice [6.1]"
    },
    {
      "description": "The idea of eternal love through human existence and connection made be cry. A heartwarming romcom with an intriguing mystery that leaves priceless impressions on you. - @kritikashah20",
      "items": [],
      "title": "Your Name - Kimi no na wa(Original title) [8.4]"
    },
    {
      "description": "It's a Romantic Dark Fantasy. Watch it when you have a good mood. The movie is full of hope and desire as the lead characters explore love in a unique way that is different and unnatural. The movie will have you shed tears, in suspense, and thrilled by shocking twists and events. - @SinaMoghaddas",
      "items": [],
      "title": "The Shape of Water [7.3]"
    },
    {
      "description": "",
      "items": [],
      "title": "TV Series"
    },
    {
      "description": "Uhm, the best. It's awesome. Stop what you're doing and go watch it. Now. - @RichardLitt",
      "items": [],
      "title": "Avatar: The Last Airbender (2005-2008) [9.3]"
    },
    {
      "description": "Reimagining of the Lady in the Lake with young King Arthur and Merlin by the legendary Frank Miller. This rendition of Merlin was awesome, very different take from previous versions. The mythical world has some twists and spin on favorites like Lord of the Rings and Witcher. - @will-chow",
      "items": [],
      "title": "Cursed (2020-?) [7]"
    },
    {
      "description": "Pretty good, if overly televised at times and with too much emphasis on sexual violence. Beautifully shot otherwise. - @RichardLitt",
      "items": [],
      "title": "Game of Thrones (2011-2019) [9.5] :star2:"
    },
    {
      "description": "A great comedic mini-series with perfect casting wonderfully depicting the motifs of Gaiman and Pratchett's novel with the same name. - @Djolo1802",
      "items": [],
      "title": "Good Omens (2019-2023) [8.2]"
    },
    {
      "description": "Excellent tv show. I love the books and I thought the adaptation was really good. - @staelsabrina",
      "items": [],
      "title": "His Dark Materials (2019-2022) [7.9]"
    },
    {
      "description": "I have loved this show since day one, and am an avid fan of all the lively and realistic characters. It is FUNNY and WELL WRITTEN and touches the nerves of Humanity, like never before. This show seems Hell-bent on showing you that every coin has two sides and every choice and decision you make has consequences, from YOU and no one else. - @gayatripalkar",
      "items": [],
      "title": "Lucifer (2016-2021) [8.2]"
    },
    {
      "description": "Outlander is a unique, satisfying adaptation of its source material, brought to life by lush scenery and potent chemistry between its leads. - @AshishKnightfury",
      "items": [],
      "title": "Outlander (2014-ongoing) [8.4]"
    },
    {
      "description": "Supernatural is somewhat endearing in that the main characters (the only ones who will be recurring) are brothers, however, the writing makes the characters more believable. They are different from each other, each with their own take on life and things that are not typical. - @AshishKnightfury",
      "items": [],
      "title": "Supernatural (2005-2020) [8.4]"
    },
    {
      "description": "The phenomenal sequel to Avatar: The Last Airbender, has just as good if not better storytelling, world building and lovable characters as the first entry in the franchise. Revolves around Korra, who's the new Avatar and you have to deal with it! - @elvybean",
      "items": [],
      "title": "The Legend of Korra (2012-2014) [8.3]"
    },
    {
      "description": "The Originals may overwhelm casual viewers with its myriad twists and bevy of supernatural beings, but this a sleek, atmospheric Vampire Diaries spinoff with potential. - @TREXXX27",
      "items": [],
      "title": "The Originals (2013-2018) [8.2]"
    },
    {
      "description": "If you are looking for romance, teenagers figuring out life and guys removing their shirts for no reason. This series is for you. It is the kind of series you can binge-watch, whilst getting sucked into the mysteries of Mystic Falls. Easy to watch with a great storyline. - @Hazelnoot",
      "items": [],
      "title": "The Vampire Diaries (2009-2017) [7.7]"
    },
    {
      "description": "The natural choice for those who read the Witcher book series, The Witcher tv adaption is mostly faithful to the books, in theme if not in actual screenplaying, with Henry Cavill in the main role, great acting and a tone similar to Game of Thrones. Bonus point for the captivating soundtrack. @Donearm\nNot as good as the source material but still an incredible show nonetheless. And yes the soundtrack is amazing! - @elvybean",
      "items": [],
      "title": "The Witcher (2019-ongoing) [8.3]"
    },
    {
      "description": "Shadow and Bone is one of the better fantasy shows to come out in the last few years. While it's not the best, it's up there! The show got me hooked from the first episode and I was pleasantly surprised by how much I enjoyed it. It has a little of something for everyone...fantasy, humor, action, drama, romance, etc. While it does take a few episodes to really get going, stay with it because it's worth it! If you like fantasy then give this show a chance, you won't be disappointed! @Evy04",
      "items": [],
      "title": "Shadow and Bone (2021-2023) [7.6]"
    },
    {
      "description": "Try the top 100 sci-fi and fantasy books as picked by NPR listeners - NPR",
      "items": [],
      "title": "You got through the list and didn't find anything?"
    },
    {
      "description": "To the extent possible under law, Richard Littauer has waived all copyright and related or neighboring rights to this work.",
      "items": [],
      "title": "License"
    }
  ],
  "metadata": {
    "last_updated": "2026-02-20T04:11:52.155Z",
    "original_repository": "RichardLitt/awesome-fantasy",
    "source_repository": "v1nvn/enhansome-fantasy",
    "source_repository_description": null,
    "title": "awesome-fantasy"
  }
}